local Dummy, super = Class(Encounter)

function Dummy:init()
    super.init(self)

    self.text =
        "* Воздух тяжелеет. Рыцарь Пустоты преграждает вам путь. Возможно единственное что вы можете делать...это ДЕЙСТВОВАТЬ."

    self.music = "Kyle"
    self.background = true

    -------------------------------------------------------
    -- КАЙЛ
    -------------------------------------------------------

    local kyle =
        self:addEnemy("kyle")

    -------------------------------------------------------
    -- ПОЗИЦИЯ КАЙЛА В БОЮ
    -------------------------------------------------------

    kyle.x = 520
    kyle.y = 260

    -------------------------------------------------------
    -- ПОЗИЦИИ ПАРТИИ
    -------------------------------------------------------

    self.party_positions = {
        {280, 70},
        {240, 160},
        {170, 250}
    }
end

return Dummy
